---
type: ExtrusionRoof
namespace: Autodesk.Revit.DB
version: 2024
members: 3
tags: [revit-api, class]
---

# ExtrusionRoof

`Autodesk.Revit.DB.ExtrusionRoof` · Revit 2024 · 3 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | GetProfile | — | `public ModelCurveArray GetProfile ()` |
| Property | CurtainGrids | — | `public CurtainGridSet CurtainGrids { get ; }` |
| Property | Parameter | — | `` |